<?php
class QAModel
{
    public static function getQAItems()
    {
        return [
            [
                'question' => '您可以透過哪些管道購買到歐印的商品？',
                'answer' => '<p>我們建構通暢的購買通路，您可以透過以下方式訂購商品：</p><p>1. 台中敦化旗艦店、南投半山夢工廠、新竹西大路大遠百、烏日倉儲</p><p>2. 歐印官網(<a href="index.php">www.all-en.com.tw</a>)</p><p>3.購物平台，如：7-11、pchome、蝦皮、Google購物、臉書購物等平台</p><p>4. 特約商店服務展示</p><p>5.百貨公司不定期快閃活動</p><p>6.不定期展覽</p>'
            ],
            [
                'question' => '如何取得團購特約商的活動？',
                'answer' => '您可以在歐印官網(https://www.all-en.com.tw/company.php)查詢所屬或家人的公司、學校是否為特約商或是聯盟商店，直接在官網下單須先向所屬公司福委取得折扣碼於結帳時輸入折扣碼即可享有團購優惠最低價；如果還沒簽訂特約，趕緊來電(04-22914216)洽詢簽約事宜哦！'
            ],
            [
                'question' => '完成訂購後多久可收到商品呢?',
                'answer' => '一般不缺貨的狀況約2~4天即可收到商品。若無現貨商品，網頁會顯示＊號，依到櫃時排單順序出貨(*號下方也會顯示預計供貨期)。 官網上沒有的顏色表示不供貨囉！'
            ],
            [
                'question' => '什麼時候有貨？若排單須等待多久呢?',
                'answer' => '訂購順序即為排單的依據，如果您急於使用，可以備註說明，我們會協調供貨順序(例如有些客戶現在訂，但一個月後才使用)，我們即可協調供貨順序喔！'
            ],
            [
                'question' => '收到貨後發現有瑕疵該如何反應給歐印呢？',
                'answer' => '請您將瑕疵處拍照後加入line官方:https://lin.ee/upPxrJS 上班時間將有專人與您聯繫，若判定為瑕疵，我們會協助您換貨，不需費用，敬請放心！'
            ],
            [
                'question' => '商品售後服務如何處理',
                'answer' => '您可以(DIY更換配件) 請上官網訂購 https://www.all-en.com.tw/otherrow_n.php?tp=1 (其他維修事項)請加入line官方: https://lin.ee/upPxrJS'
            ],
            [
                'question' => '如何加入聯盟商店或是策略行銷廣告服務',
                'answer' => '請寄信至公司 info@all-en.com.tw 將有專人服務!!'
            ],
            [
                'question' => '客訴問題反映',
                'answer' => '請來電0939653911 客服經理Janet'
            ],
            [
                'question' => '若收到產品發現有刮傷？',
                'answer' => '請傳照片到line官方帳號:@legendwalker，以利我們判斷。唯箱殼製程，非無塵室作業，且因非精密儀器設備，恕難達到完全無刮傷。敬請見諒'
            ]
        ];
    }
}
?>